/* Количество элементов в списке должно соответствовать размеру массива. Но что,если вы подсчитали неправильно? 
Давайте возвратимся к последнему примеру, как показано в листинге 10.3, сократив список инициализации до двух элементов. */
// some_data.c -- частично инициализированный массив
#include <stdio.h>
#define SIZE 4
int main(void)
{
	int some_data[SIZE] = { 1492, 1066, };
	// printf("%2s%14s\r\n"); почему-то у меня компилируется с ошибкой!
	for(int i = 0; i < SIZE; i++)
		printf("%2d%14d\r\n", i, some_data[i]);
	return 0;
}