/*Давайте рассмотрим простой пример, в котором задействована внешняя переменная.
В частности, предположим, что две функции с именами main() и critic() должны иметь доступ к переменной units. 
Это можно сделать, объявив units за пределами ранее упомянутых двух функций, как показано в листинге 12.4. 
(Примечание: назначение данного примера — демонстрация работы внешней переменной, а не ее типичное применение.)
*/
// Листинг 12.4. Программа global.c
// global.c -- использование внешней переменной
#include <stdio.h>
int units = 0; // внешняя переменная
void critic(void);
int main(void)
{
	extern int units; // необязательное повторное объявление
	printf("How many pounds to a firkin of butter?\r\n"); // Сколько фунтов весит маленький бочонок масла?
	scanf("%d", &units);
	while(units != 56)
		critic();
	printf("You must have looked it up!\r\n"); // Вы знали это!
	return 0;
}
void critic(void)
{
	// необязательное повторное объявление опущено
	printf("No luck, my friend. Try again.\r\n"); // Вам не повезло. Попробуйте еще раз
	scanf("%d", &units);
} 

Обратите внимание, что второе значение для units читается функцией critic(), но main() также известно новое значение после завершения цикла while. 
Таким образом, и main(), и critic() используют идентификатор units для доступа к одной и той же переменной. 
В рамках терминологии С мы говорим, что переменная units имеет область видимости в пределах файла, внешнее связывание и статическую продолжительность хранения.
Мы сделали units внешней переменной, определив ее за пределами определений всех функций. 
Это и все, что необходимо сделать для обеспечения доступности units всем последующим функциям в файле.
Давайте посмотрим на некоторые детали. Прежде всего, объявление переменной units там, где оно находится, делает ее доступной объявленным далее функциям без
дополнительных усилий. 
Следовательно, функция critics() пользуется переменной units.
Аналогично, ничего не придется предпринимать для предоставления доступа к units функции main(). 
Однако в main() имеется такое объявление:
extern int units;
В рассматриваемом примере это объявление является главным образом формой документирования. 
Спецификатор класса хранения extern сообщает компилятору, что любое упоминание units в данной функции относится к переменной, объявленной
за пределами этой функции, возможно, даже вне самого файла. 
И снова main() и critic() работают с внешне определенной переменной units.