/*
Гвен Глен желает сформировать каталог своих книг. Она хотела бы располагать разнообразной информацией по каждой книге: название, автор, издательство, дата
регистрации авторского права, количество страниц и стоимость книги. 
Некоторые из этих элементов данных, такие как названия, могут храниться в массивах строк. 
Другие элементы требуют массива значений типа int или float. 
При наличии семи разных массивов отслеживание всех данных может стать затруднительным, особенно если
учесть, что Гвен заинтересована в генерации нескольких списков книг: с сортировкой по названию, по авторам, по цене и т.д. 
Самое лучшее решение предусматривает использование одного массива, каждый элемент которого содержит полные сведения об одной книге.
Затем Гвен понадобится форма данных, которая может содержать строки и числа, но каким-то образом разделяя эту информацию. 
Структура С отвечает таким требованиям. Чтобы посмотреть, как создать структуру подобного рода, и каким образом она
работает, мы начнем с ограниченного примера. Для упрощения задачи мы наложим два ограничения. 
Во-первых, мы будем включать только название, автора и текущую стоимость. 
Во-вторых, мы ограничим каталог одной книгой. Однако не стоит переживать по поводу этого ограничения, поскольку вскоре мы расширим программу.
Взгляните на программу, показанную в листинге 14.1, и на ее вывод. Затем прочитайте объяснение основных ее особенностей.
*/
// Листинг 14.1. Программа book.c
/*book.c -- каталог для одной книги*/

/*объявление структуры представляет собой генеральный галан, который описывает способ формирования структуры.*/

#include <stdio.h>
#include <string.h>

char *s_gets(char *st, int n);

#define MAXTITL 41 /*максимальная длина названия + 1*/
#define MAXAUTL 31  /*максимальная длина имени автора + 1*/

struct book		/*шаблон структуры: дескриптором является book*/
{
/*ключевое слово struct. Оно указывает, что за ним следует структура. 
Далее находится необязательный дескриптор — слово book — сокращенная метка, которую можно применять для ссылки на эту структуру.*/
	char title[MAXTITL];
	char author[MAXAUTL];
	float value;
/*Это объявление описывает структуру, образованную из двух символьных массивов и одной переменной типа float. 
Оно не создает реальный объект данных, но определяет, из чего состоит такой объект.*/
};				/*конец шаблона структуры*/

int main(void)
{
	struct book library; 		/*Строка программы, создающая переменную типа структуры*/			/*объявление library в качестве переменной типа book*/
	printf("Please enter the book title.\r\n"); // Введите название книги.
	s_gets(library.title, MAXTITL); 				/*доступ к разделу названия книги*/
	printf("Now enter the author.\r\n");// Теперь введите ФИО автора.
	s_gets(library.author, MAXAUTL);
	printf("Now enter the value.\r\n");// Теперь введите цену.
	scanf("%f", &library.value);
/*library.value — это компонент value структуры library. Конструкцию library.value можно использовать подобно любой другой переменной типа float.
Аналогично, library.title можно применять в точности как массив типа char. 
По этой причине в приведенной выше программе используются такие выражения, как
	s_gets(library.title, MAXTITL);
	и
	scanf("%f", &library.value);
По существу .title, .author и .value играют роль индексов для структуры book.*/
	printf("%s by %s: $%.2f\r\n", library.title, library.author, library.value);
	printf("%s: \"%s\" ($%.2f)\r\n", library.author, library.title, library.value);
	printf("Done.\r\n"); // Готово.
	return 0;
}
/*Как и в предыдущих главах, мы применяем функцию s_gets() для удаления символа новой строки, который функция fgets() обычно оставляет во входной строке.*/
char *s_gets(char *st, int n)
{
	char *ret_val;
	char *find;

	ret_val = fgets(st, n, stdin);
	if(ret_val)
	{
		find = strchr(st, '\n'); // поиск новой строки
		if(find)			     // если адрес не равен NULL
			*find = '\0';		 // поместить туда нулевой символ
		else
			while(getchar() != '\n')
				continue; 		 // отбросить остаток строки
	}
	return ret_val;
}
/*
Ниже приведены результаты пробного запуска:
Введите название книги.
Chicken of the Andes
Теперь введите ФИО автора.
Disrna Lapoult
Теперь введите цену.
29.99
Chicken of the Andes авторства Disrna Lapoult: $29.99
Disrna Lapoult: "Chicken of the Andes" ($29.99)
Готово.
Структура, созданная в листинге 14.1, имеет три части (называемые членами или полями) - для хранения названия книги, для хранения имени автора и для хранения цены. 
Вы должны овладеть следующими тремя навыками:
• настройка формата или схемы для структуры;
• объявление переменной, соответствующей такой схеме;
• обеспечение доступа к индивидуальным компонентам переменной типа структуры.*/