/*способ описания массива предусматривает передачу функции двух указателей, первый из которых отмечает, где массив начинается (как и раньше),
а второй - где он заканчивается. Этот подход иллюстрируется в листинге 10.11. Здесь также задействован тот факт, 
что параметр типа указателя является переменной, так что вместо применения индекса для сообщения о том, к какому элементу массива обращаться,
в функции можно изменять значение самого указателя, заставляя его по очереди указывать на каждый элемент массива.*/
// Программа sum_arr2.c
// sum_arr2.c -- сумма элементов массива
#include <stdio.h>
#define SIZE 10
int sump(int *stars, int *end);
int main(void)
{
	int marbles[SIZE] = { 20, 10, 5, 39, 4, 16, 19, 26, 31, 20 };
	long answer;
	answer = sump(marbles, marbles + SIZE);
	printf("The total number of marbles is %ld.\r\n", answer); // Общая сумма элементов массива marbles равна
	return 0;
}
// использование арифметики указателей
int sump(int *start, int *end)
{
	int total = 0;
	while(start < end)
	{
		total += *start; // добавить значение к total
		start++; // переместить указатель на следующий эелемент
	}
	return total;
}