/*Функция strcpy() обладает еще двумя свойствами, которые вы можете счесть удобными. 
Во-первых, ее типом является char *. Она возвращает значение своего первого аргумента — адрес символа. 
Во-вторых, первый аргумент не обязательно должен указывать на начало массива; это позволяет копировать только часть массива. 
Оба свойства продемонстрированы в листинге 11.26.*/
// Листинг 11.26. Программа copy2.c
// copy2.c -- демонстрация использования strcpy()
#include <stdio.h>
#include <string.h> // объявление strcpy()
#define WORDS "beast" // наихудшим
#define SIZE 40
int main(void)
{
	const char *orig = WORDS;
	char copy[SIZE] = "Be the best that you can be.";
	char *ps;
	puts(orig);
	puts(copy);
	ps = strcpy(copy + 7, orig);
	puts(copy);
	puts(ps);
	return 0;
}
/*Обратите внимание, что функция strcpy() копирует нулевой символ из исходной строки. 
В этом примере нулевой символ перезаписывает букву е в слове чем внутри сору, так что новая строка заканчивается словом наихудшим (рис. 11.5). 
Кроме того, ps указывает на восьмой элемент (с индексом 7) массива сору, поскольку в первом аргументе передается сору + 7. 
Таким образом, вызов puts(ps) выводит строку, начиная с этой позиции.*/