/*
переменная status типа int заменена переменной input_is_good типа _Bool. 
Назначение булевским переменным имен, но которым ясно, что они принимают истинные и ложные значения, является общей практикой.
*/

// использование переменной типа _Bool
#include <stdio.h>
int main (void)
{
	long num;
	long sum = 0L;
	_Bool input_is_good;
	printf("Please enter an integer to be summed "); // Введите целое число для последующего суммирования
	printf("(q to quit): "); // или q для завершения программы
	input_is_good = (scanf("%ld", &num) == 1);
	while (input_is_good)
	{
		sum = sum + num;
		printf("Please enter next integer (q to quit): "); // Введите следующее целое число (или q для завершения программы)
		input_is_good = (scanf("%ld", &num) == 1);
	}
	printf("Those integers sum to %ld.\r\n", sum); // Сумма введенных целых чисел равна
	return 0;
}
/*
Обратите внимание на то, как в коде присваивает результат сравнения переменной: input_is_good = (scanf("%ld", &num) == 1);
Такое присваивание имеет смысл, поскольку операция == возвращает значение 1 или О. 
Кстати, круглые скобки, заключающие в себе выражение ==, не нужны, поскольку
операция == имеет более высокий приоритет, чем =; тем не менее, они способствуют улучшению читабельности кода. 
Кроме того, взгляните, насколько изменение имени переменной делает проверку цикла while более понятной: while (input_is_good)
*/ 