/*Ниже показана короткая программа, в которой используются все классы хранения.
Код разнесен на два файла (листинг 12.5 и листинг 12.6), так что вы должны провести многофайловую компиляцию. 
(За деталями обращайтесь в главу 9 или в руководство по компилятору.) 
Главная цель программы заключается в демонстрации всех классов хранения, а не в том, чтобы предложить проектную модель; 
в качественном проекте нет нужды в переменных с областью видимости в пределах файла.*/
// Листинг 12.5. Программа parta.c
// parta.c -- разнообразные классы хранения
// компилировать вместе с partb.c
#include <stdio.h>
void report_count();
void accumulate(int k);
int count = 0; // область видимости в пределах файла, внешнее связывание
int main(void)
{
	int value; // автоматическая переменная
	register int i; // регистровая переменная
	printf("Enter a positive integer (0 to quit): "); // Введите положительное целое число (0 для завершения)
	while(scanf("%d", &value) == 1 && value > 0)
	{
		++count; // использование переменной с областью видимости в пределах файла
		for(i = value; i >= 0; i--)
			accumulate(i);
		printf("Enter a positive integer (0 to quit): "); // Введите положительное целое число (0 для завершения)
	}
	report_count();
	return 0;
}
void report_count()
{
	printf("Loop executed %d times\r\n", count); // Цикл выполнен раз(а)
}
