/*Символьные строковые константы размещаются в статическом классе хранения, т.е. если вы используете строковую константу в функции, 
то эта строка сохраняется только однажды и существует на протяжении времени выполнения программы, даже если функция вызывается много раз. 
Вся фраза, заключенная в кавычки, действует в качестве указателя на место, где хранится строка. Это аналогично имени массива, 
которое трактуется как указатель на место размещения массива.*/
// Листинг 11.2. Программа strptr.c
// strptr.c -- строки как указатели
#include <stdio.h>
int main(void)
{
	printf("%s, %p, %c\r\n", "We", " - ", *"Space farers");
	return 0;
}