/*Предположим, что вам необходима функция, похожая на puts(), которая также сообщает, сколько символов было выведено. 
Как демонстрируется в листинге 11.15, добавить такую возможность легко.*/
// Листинг 11.15. Функия put2()
// put2.c -- выводит строку и подсчитывает символы
#include <stdio.h>
int put2(const char *string)
{
	int count = 0;
	while(*string) // общепринятый подход
	{
		putchar(*string++);
		count++;
	}
	putchar('\n'); // символ новой строки не учитывается
	return(count);
}

Следующий вызов функции выводит строку пицца: putl("пицца");
Показанный ниже вызов возвращает также количество символов, присвоенных переменной num (в данном случае 5): num = put2("пицца");