/*В листинге 11.16 представлен драйвер, предназначенный для тестирования putl() и put2(), а также вложенных вызовов этих функций.*/

/*При вводе и выводе вы не ограничены только функциями стандартной библиотеки С. 
Если они недоступны или по какой-то причине не нравятся, можете подготовить собственные версии на основе футкций getchar() и putchar(). 
Предположим, что вам нужна функция, подобная puts(), которая нe добавляет автоматически символ новой строки.
*/

// Листинг 11.16. Программа put_put.c
// put_put.c -- функции вывода, определенные пользователем
#include <stdio.h>
void put1(const char *);
int put2(const char *);
int main(void)
{
	put1("If i'd as much money"); // Если бы у меня было столько денег
	put1(" as I could spend,\r\n"); // сколько я мог бы потратить
	printf("I count %d characters.\r\n", put2("I never would cry old chairs to mend.")); // Получилось %d символ // то я никогда не заботился бы о починке старых башмаков
	return 0;
}
void put1(const char *string)
{
	while(*string) // эквивалетно *string != '\0'
		putchar(*string++);
}
int put2(const char *string)
{
	int count = 0;
	while(*string)
	{
		putchar(*string++);
		count++;
	}
	putchar('\n');
	return(count);
}

/*Мы применяем printf() для вывода значения функции put2(), но в процессе выяснения этого значения эта функция сначала должна быть выполнена, что приводит к выводу строки.*/
