/*
Если 1 или О допускается использовать в качестве условия проверки в операторе while, то можно ли применять для этих целей
другие числа? 
И если да, то что произойдет?
*/
// какие значения являются истиннными?
#include <stdio.h>
int main (void)
{
	int n = 3;
		while (n)
		printf("%2d is true\r\n", n--);
		printf("%d is false\r\n", n);
		n = -3;
		while (n)
		printf("%2d is true\r\n", n++);
		printf("%2d is false\r\n", n);
		return 0;
}
/*
Первый цикл выполняется, когда переменная n принимает значения 3, 2 и 1, но прекращает выполнение, когда n равна О. 
Подобным же образом второй цикл выполняется, когда переменная n принимает значения -3, -2 и -1, но завершается, как только n становится равной О. 
В общем случае все ненулевые значения рассматриваются как истинные, а ложные считается только О. 
В языке С истина имеет очень широкое толкование!
Говоря по-другому, цикл while выполняется до тех пор, пока в результате вычисления его условия проверки получается ненулевое значение. 
Это обстоятельство перемещает условия проверки из рамок “истина/ложь” в числовую область. 
Имейте в виду, что условное выражение принимает значение 1, если оно истинно, и О, если ложно, поэтому все выражения подобного рода в действительности являются числовыми.
*/ 