/*
“Если символ является пробелом, он выводится, в противном случае выводится символ, следующий за ним в последовательности кодов ASCII”.
*/
#include <stdio.h> // вносит изменения во входные данные, сохраняя пробелы
#define SPACE ' '  // кавычка, пробел, кавычка
int main (void)
{
	char ch;
	ch = getchar(); // читать символ
	while (ch != '\n') // пока не встретится конец строки
		{
			if (ch == SPACE) // оставить пробел нетронутым
				putchar(ch); // символ не меняется
			else
				putchar(ch + 1); // изменить другие символы
			ch = getchar(); //получить следующий символ
		}
		putchar (ch);
		return 0;
}
