#include <stdio.h>
int main (void)
{
	float baby;
	printf("\a enter the desired amount of monthly salary: "); /* 1 воспроизводит звуковой сигнал (вызванный последовательностью \а),
	 а затем выводит следующию фразу: 
	 введите желаемую сумму месячной зарплаты: */
	printf("$_______\b\b\b\b\b\b\b"); /* 2 результатом семи символов возврата на одну позицию влево будет перемещение курсора на семь позиций влево,
	курсор проходит через семь символов подчеркивания и располагается непосредственно после $ */
	scanf("%f", &baby);
	printf("\r\n\t$%.2f in mouth complies $%.2f in yers.", baby, baby * 12.0); /* 3 Символ табуляций \t перемещает курсор в следующую позицию табуляции в этой строке
	 - обычно, но не обязательно, в позицию 9. Затем выводится оставшаяся часть строки. */
	printf("\rWoW!\n"); /* 4 \r перемещает курсор в начало текущей строки. Затем отображается строка WoW! и последовательность \n переводит курсор на следующую строку */
	return 0;
}