/*Какое значение возвращает strcmp(), если строки не совпадают? В листинге 11.22 показан пример.*/
/*strcmp() (от string comparison — сравнение строк). 
Эта функция делает для строк то же, что операции отношений делают для чисел. 
В частности, она возвращает 0, если оба строковых аргумента одинаковы, и ненулевое значение в противном случае. */
// Листинг 11.22. Программа compback.c
// compback.c -- значения, возвращаемые функцией strcmp()
#include <stdio.h>
#include <string.h>
int main(void)
{
	printf("strcmp(\"A\", \"A\") is ");
	printf("%d\r\n", strcmp("A", "A"));

	printf("strcmp(\"A\", \"B\") is ");
	printf("%d\r\n", strcmp("A", "B"));	

	printf("strcmp(\"B\", \"A\") is ");
	printf("%d\r\n", strcmp("B", "A"));

	printf("strcmp(\"C\", \"A\") is ");
	printf("%d\r\n", strcmp("C", "A"));	

	printf("strcmp(\"Z\", \"a\") is ");
	printf("%d\r\n", strcmp("Z", "a"));

	printf("strcmp(\"apples\", \"apples\") is ");
	printf("%d\r\n", strcmp("apples", "apples"));	
	return 0;
}
/*Сравнение символа "А" с самим собой возвращает О. Сравнение "А" и "В" возвращает -1, а обратное сравнение возвращает 1. 
Из этих результатов следует, что функция strcmp() возвращает отрицательное число, если первая строка в алфавитном порядке
предшествует второй, и положительное число, если порядок следования строк противоположный.
Таким образом, сравнение "С" с "А" дает 1. Другие системы могут возвратить 2, т.е. разность между значениями ASCII-кодов. 
Стандарт ANSI требует, чтобы функция strcmp() возвращала отрицательное число, когда первая строка в алфавитном порядке предшествует второй, 0, если строки совпадают, 
и положительное число, если первая строка в алфавитном порядке следует за второй. 
Однако точные числовые значения зависят от реализации. Например, ниже приведен вывод для другой реализации, в которой возвращается разность между значениями кодов символов:
*/

/*
strcmp("А", "А") возвращает О
strcmp("A", "В") возвращает -1
strcmp("B", "А") возвращает 1
strcmp("C", "А") возвращает 2
strcmp("Z", "а") возвращает -7
strcmp("apples", "apples") возвращает 115*/

/*А что, если начальные символы строк идентичны? Вобщем случае функция strcmp() продвигается по строкам до тех пор, пока не найдет первую пару несовпадающих символов. 
После этого она возвращает соответствующий код. В самом последнем примере строки "apples" и "apple" совпадают вплоть до финального символа в первой строке. 
Этот символ сравнивается с шестым символом строки "apple", которым является нулевой символ, имеющий ASCII - код 0. 
Так как нулевой символ является первым в последовательности ASCII, символ s находится после него, функция возвращает положительное значение.
Последнее сравнение показывает, что strcmp() сравнивает все символы, а не только буквы, поэтому вместо утверждения, что сравнение производится в алфавитном
порядке, можно сказать, что strcmp() следует последовательности сопоставления машины. 
Это означает, что символы сравниваются согласно их числовым представлениям, которыми обычно являются значения ASCII-кодов. 
В кодировке ASCII коды прописных букв предшествуют кодам строчных букв. Таким образом, strcmp("Z", "а") возвращает отрицательное число.
Чаще всего о точном возвращаемом значении можно не беспокоиться. 
Вполне достаточно знать, нулевое оно или нет, т.е. совпадают ли строки. 
Если требуется сортировать строки в алфавитном порядке, то нужно знать, каким является результат сравнения — положительным, отрицательным или нулевым.*/