/*Функция fseek() позволяет трактовать файл подобно массиву и переходить непосредственно к любому байту в файле, открытом с помощью fopen(). 
Чтобы ознакомиться с работой fseek(), давайте напишем программу (листинг 13.4), которая отображает содержимое файла в обратном порядке. 
Обратите внимание, что fseek() принимает три аргумента и возвращает значение int. 
Функция ftell() возвращает текущую позицию в файле как значение long.*/

// Листинг 13.4. Программа reverse.c

/* reverse.c -- отображает содержимого файла в обратном порядке */
#include <stdio.h>
#include <stdlib.h>

#define CNTL_Z '\032' /* маркер конца файла в текстовых файлах DOS */
#define SLEN 81

int main(void)
{
	char file[SLEN];
	char ch;
	FILE *fp;
	long count, last;

	puts("Enter the name of the file to be processed:"); // Введите имя файла для обработки
	scanf("%80s", file);
	if((fp = fopen(file, "rb")) == NULL)
	{										/* режим только для чтения */
		printf("reverse can't open %s\r\n", file);
		exit(EXIT_FAILURE);
	}
	fseek(fp, 0L, SEEK_END); 				/* перейти в конец файла */
	/* устанавливает позицию со смещением О байтов от конца файла. Это означает установку позиции в конец файла. */
	last = ftell(fp); /*присваивает last количество байтов от начала до конца файла.*/

	for(count = 1L; count <= last; count++)
	{
		fseek(fp, -count, SEEK_END); 		/* двигаться в обратном направлении */
		ch = getc(fp);
		if(ch != CNTL_Z && ch != '\r')		/* файлы MS_DOS */
		putchar(ch);
	}
	putchar('\n');
	fclose(fp);
	return 0;
}

/*
Вот вывод программы для одного из файлов:
Введите имя файла для обработки:
Cluv
.С екызя ан ьтавориммаргорп ястиварн енм огесв ешьлоБ

В этой программе применяется двоичный режим, поэтому она может иметь дело как с текстовыми файлами MS-DOS, так и с файлами Unix. 
Однако ее работа может оказаться некорректной в среде, в которой для текстовых файлов используется какой-то другой формат.

На заметку!
Если вы запускаете программу в среде командной строки, то программа ожидает, что файл
с указанным именем находится в том же каталоге (или папке), что и сама исполняемая программа.
Если программа запускается из IDE-среды, то каталог, в котором производится поиск файла, зависит от реализации. 
Например, по умолчанию Microsoft Visual Studio 2012 просматривает каталог, содержащий исходный код, a XCode 4.6 ищет файл в каталоге, где
расположен исполняемый файл.
*/