/* программа, которая выводит тарифы почтового обслуживания первого класса. 
(В 2013 году тарифы составляли 46 центов за первую унцию и 20 центов за каждую последующую унцию пересылаемого груза.) */

// тарифы почтового обслуживания первого класса
#include <stdio.h>
int main (void)
{
	const int FIRST_OZ = 46; // тариф 2013 года
	const int NEXT_OZ = 20; // тариф 2013 года
	int ounces, cost;
	printf(" ounces cost\r\n");
	for (ounces = 1, cost = FIRST_OZ; ounces <= 16; ounces++, cost += NEXT_OZ)
		printf("%5d $%4.2f\r\n", ounces, cost / 100.0);
	return 0;
}
/* Операция запятой в программе применяется в выражениях инициализации и обновления.
Ее наличие в первом выражении приводит к инициализации переменных ounces и cost. 
Второе ее вхождение вызывает увеличение на 1 переменной ounces и увеличение на 20 (значение константы NEXT_OZ) переменной cost на каждой итерации.
Все вычисления делаются в спецификациях цикла for.