/*Напишите программу, которая выводит результаты применения операции деления по модулю.
Пользователь должен первым ввести целочисленное значение, которое используется в качестве второго операнда и остается неизменным.
Затем пользователь должен вводить числа, для которых будет вычисляться результат деления по модулю.
Процесс должен прерываться вводом значения, которое равно или меньше О.
Пример выполнения этой программы должен выглядеть следующим образом:

Эта программа вычисляет результаты деления по модулю.
Введите целое число, которое будет служить вторым операндом: 256
Теперь введите первьй операнд: 438
438 % 256 равно 182

Введите следующее число для первого операнда (<= О для выхода из
програ^ммы): 1234567
1234567 % 256 равно 135

Введите следующее число для первого операнда (<= О для выхода из
програ^ммы) : О

Готово */

#include <stdio.h>
int main (void)
{
	int enter1, enter2;
	int computing1;
	printf("This program calculates the results modulo division.\r\n");
	printf("Enter an integer, which will serve as the second operand: ");
	scanf("%d", &enter2);
	while (enter1 > 0)
	{
		printf("Now enter the first operand: ");
		scanf("%d", &enter1);
		computing1 = enter1 % enter2;
		printf("%d %% %d = %d\r\n", enter1, enter2, computing1);
		printf("Enter the next number for the first operand\r\n(to exit from the program enter 0)\r\n");
	}
	printf("Done!");
	return 0;
}