/* Напишите программу, которая запрашивает у пользователя ввод количества
дней и затем преобразует это значение в количество недемь и дней. Например,
18 дней программа должна преобразовать в 2 недели и 4 дня. Отображайте результаты
в следующем формате:
18 дней составляют 2 недели и 4 дня.
Чтобы пользователь мог многократно вводить количество дней, используйте
цикл while. Цикл должен завершаться при вводе пользователем неположительного
значения, например, О или -20. */
#include <stdio.h>
int main (void)
{
	int day, day1, day2;
	printf("\r\nEnter the number of days\r\n");
	while (day > -0)
	{
		scanf("%d", &day);
		day1 = day / 7;
		day2 = day % 7;
		printf("\r\n%d days is %d week and %d day\r\n", day, day1, day2);
	}
	return 0;
}