6. Какие спецификаторы преобразования вы бы использовали, чтобы вывести седующие данные?
а. Десятичное целое число с шириной поля, равной количеству цифр этого числа.
a: %d
б. Шестнадцатеричное целое число в форме 8А с шириной поля 4 символа.
б: %4x
в. Число с плавающей запятой в форме 232.346 с шириной поля 10 символов.
в: %10.3f
г. Число с плавающей запятой в форме 2.33e+002 с шириной поля 12 символов.
г: %12.2e
д. Строку, выровненную по левому краю внутри поля шириной 30 символов.
д: %-30s
7. Какие спецификаторы преобразования вы бы использовали, чтобы вывести следующие данные?
a. целое число типа unsigned long в поле шириной 15 символов.
a: %15.lu
б. Шестнадцатеричное целое число в формате 0x8a в поле шириной 4 символа
б: %#4x
в. Число с плавающей запятой в форме 2.33E+02 в поле шириной 12 символов с выравниванием по левому краю поля.
в: %-12.2E
г. Число с плавающей запятой в форме +232.346 в поле шириной 10 символов.
г: %+10.3f
д. Первые 8 символов строки в поле шириной 8 символов.
д: %8.8s
8. Какие спецификаторы преобразования вы бы использовали, чтобы вывести следующие данные?
a. Десятичное целое число, имеющее минимум 4 цифры, в поле шириной 6 символов.
a: %6.4d
б. Восьмеричное целое число в поле, ширина которого будет указываться в списке аргументов.
б: %*o
в. Символ в поле шириной 2 символа.
в: %2c
г. Число с плавающей запятой в форме +3.13 в поле с шириной, которая равна количеству символов в этом числе.
г: %+0.2f
д. Первые пять символов в строке, выровненной по левому краю поля шириной 7 символов.
д: %-7.5s
9. Для Каждой из следующих входных строк напишие оператор scanf(), чтобы прочитать их. Обьявите также переменные или массивы, используемые в операторе.
a.  int b;
	scanf("%d", &b);
б. float a;
   double b;
   	scanf("%f", &a);       scanf("%f%f", &a, &b);
   	scanf("%f", &b);
   	printf("%2.2f %e", a, b);
в. char a[10];
   scanf("%s", a);
   printf("%s", a);
г. int d;                       char d[20];
	scanf("%s", &d);			int b;
	printf("%s", d);			scanf("%s %d", d, &b);
д. int d;
   scanf("%*s %d", &d);
   printf("%*s, %d", d);