#include <stdio.h> 
/* напишите программу, которая присваивает переменной типа double значение 1.0 / 3.0 и переменной типа float значение 1.0 / 3.0;
отобразите каждый результат три раза: в первом случае с четырьмя цифрами справа от десятичной точки, во втором случае c двенадцатью цифрами 
и в третьем случае с шестнадцатью цифрами. Включите такжу в программу заголовочный файл float.h и выведите значения FLT_DIG и DBL_DIG.
Согласуются ли выведенные значения со значением 1.0/0.3?*/ 
#include <float.h> 
int main (void)
{
	double a = 1.0 / 3.0;
	float b = 1.0 / 3.0;
	printf("%.4f %.4f\r\n", a, b);
	printf("%.12f %.12f\r\n", a, b);
	printf("%.16f %.16f\r\n", a, b);
	printf("%f %f", FLT_DIG, DBL_DIG);
	return 0;
}