#include <stdio.h> // Напишите программу, которая запрашивает имя и выполняет с ним следующие действия.
// выводит его заключенным в двойные кавычки. выводит его в поле шириной 20 символов, при этом все поля заключается в кавычки, а имявыравнивается по правому краю поля.
// выводит его с левого края поля шириной 20 символов, при этом все поля заключается в кавычки.
// выводит его в поле шириной, на три символа превышающем длину имени.
int main (void)
{
	char name[50];
	printf("Enter ur name ");
	scanf("%s", name);
	printf("\"%s\" \"%20.5s\" \"%-20.5s\"\r\n%8s", name, name, name, name);
	return 0;
}