/*
Циклы while и for являются циклами с предусловием. Условия проверки вычисляются перед каждой итерацией цикла, 
поэтому вполне возможно, что операторы, помещенные в цикл, никогда не выполнятся. 
В языке С имеется также цикл с постусловием, в котором проверка условия производится после прохода каждой итерации цикла,
благодаря чему гарантируется выполнение операторной части цикла минимум один раз. 
Эта разновидность цикла называется циклом do while. В листинге do_while.c приведен пример.
*/
// цикл с постусловием
#include <stdio.h>
int main (void)
{
	const int secret_code = 13;
	int code_entered;
	do
	{
		printf("To enter the triskaidekaphobia therapy club,\r\n"); // Чтобы войти в клуб лечения трискадекафобии
		printf("please enter the secret code number: "); // пожалуйста, введите секретный код:
		scanf("%d", &code_entered);
	}
	while (code_entered != secret_code);
	printf("Congratulations! You are cured!\r\n"); // Поздравляем! Вас вылечили!
	return 0;
}