/*Числа выглядят знакомыми; в этом и заключается аспект “псевдо”. 
Каждый раз, когда главная программа запускается, старт происходит с одного и того же начального числа 1. 
Проблему можно обойти путем ввода второй функции по имени srandl(), которая позволит переустанавливать начальное число. 
Трюк заключается в том, чтобы сделать next статической переменной с внутренним связыванием, которая известна только функциям randl() и srandl(). 
(Эквивалент srandl() в библиотеке С называется srand().) Добавьте функцию srandl() в файл, содержащий randl().
В листинге 12.9 представлена модифицированная версия.*/
// Листинг 12.9. Программа s_and_r.c
/*s_and_r -- файл для функций randl() и srandl()*/
/*используется переносимый алгоритм ANSI C*/
static unsigned long int next = 1; /*начальное число*/
int randl(void)
{
	/*магическая формула для генерации псевдослучайных чисел*/
	next = next * 1103515245 + 12345;
	return (unsigned int) (next / 65536) % 32768;
}
void srand1(unsigned int seed)
{
	next = seed;
}
/*Обратите внимание, что next — это статическая переменная с областью видимости в пределах файла и внутренним связыванием. 
Это означает, что она может использоваться как randl(), так и srandl(), но не функциями в других файлах. 
Для тестирования этих функций применяйте драйвер из листинга 12.10.*/