/* Напишите программу, которая читает символы из стандартного ввода вплоть до конца файла.  Для каждого символа программа должна сообщать, является ли он буквой. 
Если символ — буква, программа вдобавок должна сообщать ее порядковый номер в алфавите. Например, буквы с и С будут иметь номер 3.
Предусмотрите в программе функцию, которая принимает символ в качестве аргумента и возвращает его порядковый номер в алфавите, если он является буквой, и -1 в противном случае.*/
#include <stdio.h>
#include <ctype.h>
int program(char);
int main(void)
{
	char ch;
	while((ch = getchar()) != '#')
	{
		printf("The location of %c is %d.\r\n", ch, program(ch));
	}
	return 0;
}
int program(char a)
{
	if(islower(a))
	{
		return a - 'a' + 1;
	}
	else if(isupper(a))
	{
		return a - 'A' + 1;
	}
	else
	{
		return -1;
	}
}