/*
Некоторые примеры цикла while представляли собой неопределенные циклы. Это означает, что заранее нельзя сказать, 
сколько раз цикл выполнится до того, как выражение станет ложным. 
Например, когда в листинге 6.1 использовался интерактивный цикл для суммирования целых чисел, 
заранее не было известно, сколько чисел будет введено. 
Тем не менее, в других примерах применялись циклы со счетчиком. Такие циклы выполняют заранее известное количество итераций. 
приведен пример оператора цикла while со счетчиком.
*/
// цикл со счетчиком
#include <stdio.h>
int main (void)
{
	const int NUMBER = 22;
	int count = 1; 						// инициализация
	while (count <= NUMBER) 			// проверка
	{
		printf("Be my Valentine!\r\n"); // действие
		count++; 						// обновление значения count
	}
}
/*
И хотя форма цикла, использованная в листинге 6.10, работает прекрасно, это не самый лучший выбор в подобной ситуации, 
поскольку действия, определяющие цикл, не собраны вместе. Давайте исследуем этот вопрос более глубоко.
*/ 