/*В главе 7 было представлено семейство функций обработки символов сtуре.h.
Эти функции не могут быть применены к строке как единому целому, но могут использоваться с отдельными символами в строке. 
В листинге 11.30 определена функция, которая применяет toupper() к каждому символу строки, преобразуя символы всей строки в верхний регистр. 
В нем также определена функция, которая использует ispunct() для подсчета знаков препинания в строке. 
Наконец, здесь применяется функция strchr(), как было описано ранее, для обработки символа новой строки, если таковой присутствует, в строке, прочитанной с помощью fgets().*/
// mod_str.c -- модифицирует строку
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#define LIMIT 81
void ToUpper(char *);
int PunctCount(const char *);
int main(void)
{
	char line[LIMIT];
	char *find;
	puts("Please enter a line:");
	fgets(line, LIMIT, stdin);
	find = strchr(line, '\n'); // поиск символа новой строки
	if(find) // если адрес не является NULL
		*find = '\0'; // поместить туда нулевой символ
	ToUpper(line);
	puts(line);
	printf("That line has %d punctuation characters.\r\n", PunctCount(line)); // эта строка содержит знаков препинания.
	return 0;
}
/*Функция ToUpper() применяет toupper() к каждому символу строки. (Поскольку в С делается различие между символами верхнего и нижнего регистра, 
эти имена функций считаются разными.) Как определено в стандарте ANSI С, функция toupper() изменяет только символы, представленные в нижнем регистре.*/
void ToUpper(char *str)
{
/*Цикл while(*str) обрабатывает каждый символ в строке, на которую указывает str, пока не будет достигнут нулевой символ. 
В этот момент *str становится равным 0 (код нулевого символа), или ложному значению, и цикл прекращается.*/
	while(*str)
	{
		*str = toupper(*str);
		str++;
	}
}
int PunctCount(const char *str)
{
	int ct = 0;
/*Цикл while(*str) обрабатывает каждый символ в строке, на которую указывает str, пока не будет достигнут нулевой символ. 
В этот момент *str становится равным 0 (код нулевого символа), или ложному значению, и цикл прекращается.*/
	while(*str)
	{
		if(ispunct(*str))
			ct++;
		str++;
	}
	return ct;
}
/*В этой программе используется сочетание функций fgets() и strchr() для чтения строки ввода и замены символа новой строки нулевым символом. 
Главное отличие между этим подходом и применением функции s_gets() заключается в том, что s_gets() 
отбрасывает оставшиеся символы строки ввода(если они есть), подготавливая программу к обработке следующего оператора ввода. 
В данном случае существует только один оператор ввода, поэтому такой дополнительный шаг не нужен.
*/