/*
При тестировании функции было бы удобно располагать возможностью передачи этой функции нескольких значений, чтобы увидеть, как она реагирует. 
Это предполагает настройку цикла ввода.
Естественным вариантом является цикл while. Функцию scanf() можно использоватьдля ввода двух значений одновременно. 
Если функция scanf() успешно прочитает два значения, она возвратит 2, поэтому циклом можно управлять, сравнивая
возвращаемое значение scanf() со значением 2. 
Еще один момент: чтобы воспользоваться функцией power() в программе, ее понадобится объявить, как вы объявляете
применяемые в программе переменные. 
Окончательная программа приведена в листинге power.c
*/
// возводит числа в целые степени
#include <stdio.h>
double power(double n, int p); // прототип ANSI
int main (void)
{
	double x, xpow;
	int exp;
	printf("Enter a number and the positive integer power"); // Введите число и положительную целую степень
	printf(" to which\r\nthe number will be raised. Enter q"); // в которую \nчисло будет возведено. Для завершения программы
	printf(" to quit.\r\n"); // введите q.
	while (scanf("%lf%d", &x, &exp) == 2)
	{
		xpow = power(x, exp); // вызов функции
		printf("%.3g to the power %d is %.2g\r\n", x, exp, xpow); // в степени равно
		printf("Enter next pair of numbers or q to quit.\r\n"); // Введите следующую пару чисел или q для завершения.
	}
	printf("Hope you enjoyed this power trip -- buy!\r\n"); // Надеемся, что вы оценили это упражнение -- до свидания!
	return 0;
}
double power (double n, int p) // определение функции
{
	double pow = 1;
	int i;
	for (i = 1; i <= p; i++)
		pow *= n;
	return pow;					// возвратить значение pow
}
