/*Иногда удобно, чтобы одна структура содержала другую структуру, которая называется вложенной. Например, Шейла Пироски создает структуру с информацией о своих друзьях. 
Одним из членов структуры является, естественно, имя друга. Однако имя само может быть представлено с помощью структуры, с отдельными записями для имени и фамилии. 
В листинге 14.3 показан сжатый пример работы Шейлы.*/
// листинг 14.3. Программа friend.c
// frirnd.c -- пример вложенной структуры

#include <stdio.h>

#define LEN 20

const char *msgs[5] = 
{
	"	Thank you for the wonderful evening, ", // Благодарю вас за чудесно проведенный вечер
	"You certainly prove that a ", // Вы однозначно продемонстрировали, что
	"is a special kind of guy. We must get together", // являет собою особый тип мужчины. Мы обязательно должны встретиться
	"over a delicious ", // за восхитительным ужином  
	" and have a few laughs" // и весело провести время
};
/*шаблон структуры: дескриптором является names*/
struct names // первая структура
{
	char first[LEN];
	char last[LEN];
};
/*Структура — тип данных: запись, состоящая из нескольких переменных (или констант) разного типа.*/
struct guy // вторая структура
{
/*Во-первых, обратите внимание на то, каким образом вложенная структура устанавливается в объявлении структуры. 
Она просто объявляется, как если бы это была переменная типа int: struct names handle;*/
	struct names handle; // вложенная структура
/*Такое объявление говорит о том, что handle является переменной типа struct names. Разумеется, файл должен также включать объявление структуры names.*/
	char favfood[LEN];
	char job[LEN];
	float income;
};

int main(void)
{
	struct guy fellow = // инициализация переменной
	{
		{ "Ewen", "Villard" }, // Билли Бонс
		"grilled salmon", // запеченными омарами
		"personality coach", // персональный тренер
		68112.00
	};
/*посмотрите, как получать доступ к члену вложенной структуры; нужно всего лишь два раза воспользоваться операцией точки:*/
	printf("Dear %s, \n\n", fellow.handle.first);
	printf("%s%s.\r\n", msgs[0], fellow.handle.first);
	printf("%s%s\r\n", msgs[1], fellow.job);
	printf("%s\r\n", msgs[2]);
	printf("%s%s%s", msgs[3], fellow.favfood, msgs[4]);
	if(fellow.income > 150000.0)
		puts("!!");
	else if(fellow.income > 75000.0)
		puts("!");
	else
		puts(".");
	printf("\r\n%40s%s\r\n", " ", "See you soon,");
	printf("%40s%s\r\n", " ", "Shalala");

	return 0;
}