/*Нам необходима функция, которая сравнивает содержимое строк, а не их адреса.
Можно было бы создать такую функцию самостоятельно, но функция подобного рода уже имеется — strcmp() (от string comparison — сравнение строк). 
Эта функция делает для строк то же, что операции отношений делают для чисел. 
В частности, она возвращает 0, если оба строковых аргумента одинаковы, и ненулевое значение в противном случае. 
В листинге 11.21 приведена переделанная программа.*/
// Листинг 11.21. Программа compare.c
// compare.c -- это программа будет работать
#include <stdio.h>
#include <string.h> // объявление strcmp()
#define ANSWER "Grant"
#define SIZE 40
char *s_gets(char *st, int n);
int main(void)
{
	char try[SIZE];
	puts("Who is buried in Grant's tomb?"); // Кто похоронен в могиле Гранта?
	s_gets(try, SIZE);
	while(strcmp(try, ANSWER) != 0)
	{
		puts("No, that's wrog. Try again."); // Неправильно! Попытайтесь еще раз
		s_gets(try, SIZE);
	}
	puts("That's right!"); // Теперь правильно!
	return 0;
}
char *s_gets(char *st, int n)
{
	char *ret_val;
	int i = 0;
	ret_val = fgets(st, n, stdin);
	if(ret_val)
	{
		while(st[i] != '\n' && st[i] != '\0')
			i++;
		if(st[i] == '\n')
			st[i] == '\0';
		else // требуется наличие words[i] == '\0'
			while(getchar() != '\n')
				continue;
	}
	return ret_val;
}
На заметку!
Поскольку любое ненулевое значение трактуется как истинное, опытные программисты на С наверняка сократят этот оператор while до while (strcmp (try, ANSWER)).
Одно из примечательных свойств функции strcmp() заключается в том, что она сравнивает строки, а не массивы. 
Хотя массив try занимает 40 ячеек памяти, а строка "Грант" — только шесть (одна ячейка отводится под нулевой символ), 
при сравнении просматривается только часть массива try до первого встреченного нулевого символа.
Следовательно, strcmp() может использоваться для сравнения строк, хранящихся в массивах разных размеров.
А что, если пользователь введет в качестве ответа "ГРАНТ", "грант" или "Улисс С. Грант"? Программа сообщит о том, что ответ неправильный. 
Чтобы сделать программу более дружественной, необходимо предусмотреть все возможные правильные ответы. Для этого есть несколько приемов. 
Например, с помощью директивы #define можно определить ответ как "ГРАНТ" и написать функцию, которая преобразует все введенные буквы в прописные. 
Это устраняет проблему употребления прописных букв, но по-прежнему остаются другие формы ответа, 
о которых следует позаботиться, а также учесть тот факт, что жена Гранта, Джулия, также похоронена в той же могиле.
Мы оставляем эти задачи в качестве упражнений для самостоятельной проработки.