// использование цикла for для построения таблицы кубов
#include <stdio.h>
int main (void)
{
	int num;
	printf("    n   n cubed\r\n");
	for (num = 1; num <= 6; num++)
		printf("%5d %5d\r\n", num, num * num * num);
	return 0;
}
/*
Программа в листинге for_cube.c выводит целые числа от 1 до 6 и результат их возведения в куб.
Первая строка цикла for немедленно сообщает всю информацию параметрах цикла: начальное значение num,
конечное значение num и величину, на которую num увеличивается при каждом проходе цикла.
*/ 