/*показан слегка измененный код предыдущей программы,
в котором начальный символ внутреннего цикла изменяется в зависимости от
номера итерации внешнего цикла. Вдобавок здесь используется комментарий более
нового стиля и const вместо #define, что способствует освоению обоих подходов.*/

// применение зависимых вложенных циклов
#include <stdio.h>
int main (void)
{
	const int ROWS = 6;
	const int CHARS = 6;
	int row;
	char ch;
	for (row = 0; row < ROWS; row++)
	{
		for (ch = ('A' + row); ch < ('A' + CHARS); ch++)
			printf("%c", ch);
		printf("\r\n");
	}
	return 0;
}
/*Поскольку на каждой итерации внешнего цикла row добавляется к 'А', переменная
ch в каждой строке инициализируется следующим по порядку символом. Тем не
менее, условие проверки не изменяюсь, так что каждая новая строка по-прежнему заканчивается
символом F. В результате каждая следующая выводимая строка содержит
на один символ меньше, чем предыдущая.*/ 