/*Числа могут храниться либо как строки, либо в числовой форме. Хранение числа в виде строки означает хранение символов для цифр. 
Например, число 213 может быть сохранено в массиве символьной строки как цифры '2', '1', '3' , '\0'. 
Хранение 213 в числовой форме означает его хранение как значения, скажем, типа int.
Числовые формы в С требуются для числовых операций, таких как сложение и сравнение, но отображение чисел на экране требует строковой формы, поскольку экран воспроизводит символы. 
Функции printf() и sprintf() посредством %d и других спецификаторов преобразуют числовые формы в строковые, а функция scanf() может преобразовывать вводимые строки в числовые формы. 
В С также имеются функции, единственным назначением которых является преобразование строковых форм в числовые.
Предположим, к примеру, что вам нужна программа для работы с аргументом командной строки. 
К сожалению, аргументы командной строки читаются как строки.
Вследствие этого, чтобы иметь дело с числовым значением, сначала вы должны преобразовать полученную строку в число. 
Если число целое, можете применить функцию atoi() (от alphanumeric to integer - преобразование алфавитно-цифрового значения в целое число). 
Эта функция принимает строку в качестве аргумента и возвращает соответствующее целочисленное значение. 
В листинге 11.32 приведен пример использования.*/
// Листинг 11.32. Программа hello.с
/* hello.c -- преобразует аргумент командной строки в число */
#include <stdio.h>
#include <stdlib.h> /*содержит объявление функции atoi(). 
В этом заголовочном файле также объявлены функции atof() и atol(). 
Функция atof() преобразует строку в значение типа double, а функция atol() — в значение типа long. 
Они работают аналогично atoi(), и поэтому имеют, соответственно, тип double и тип long.*/
int main(int argc, char *argv[])
{
	int i, times;
	/*Функция atoi() преобразует эту строку в целочисленное значение 3, которое присваивается переменной times. Затем times задает количество итераций цикла for.*/
		if(argc < 2 || (times = atoi(argv[i])) < 1) 
	printf("Usage: %s positive-number\r\n", argv[0]); // Использование положительное-число
	else
		for(i = 0; i < times; i++)
			puts("Hello, good looking!"); // Хорошего дня!
		return 0;
}
/*Функция atoi() по-прежнему работает, если строка только начинается с целого числа. 
В таком случае она преобразовывает символы до тех пор, пока не встретит символ, не являющийся частью целого числа. 
Например, atoi("42regular") возвращает целое число 42. А что, если командной строкой будет hello what? 
В нашей реализации С функция atoi() возвращает значение О, если ее артумент не распознается как числовой. 
Тем не менее, в стандарте С указано, что поведение в данном случае не определено.*/