/*
Эта программа вычисляет, сколько банок краски необходимо для того, чтобы покрасить заданное количество квадратных футов поверхности. 
Основной алгоритм прост: нужно разделить общее число квадратных футов на количество квадратных футов, которые можно покрасить содержимым одной банки. 
Тем не менее, предположим, что ответом будет 1,7 банки. В магазине можно купить только полные, а не частично заполненные банки, поэтому придется приобрести две банки. 
Следовательно, программа должна округлять ответ до следующего целого числа. 
Для обработки такой ситуации применяется условная операция, и она также используется при выводе слова “банка” или “банки”.
*/ 
// использование условной операции
#include <stdio.h>
#define COVERAGE 350 // число квадратных футов на одну банку краски
int main(void)
{
	int sq_feet;
	int cans;
	printf("Enter number of square feet to be painted:\r\n");
	while(scanf("%d", &sq_feet) == 1)
	{
		cans = sq_feet / COVERAGE;
		cans += ((sq_feet % COVERAGE == 0)) ? 0 : 1;
		printf("You need %d %s of paint.\r\n", cans, cans == 1 ? "can" : "cans");
		printf("Enter next value (q to quit):\r\n");
	}
	return 0;
}