/*
Нашей первой скромной целью является создание функции, которая выводит 40 звездочек в строке. 
Чтобы придать этой функции смысл, м ы включим ее в программу, которая выводит простой заголовок письма. 
Полный код программы приведен в листинге 9.1. Она состоит из функций main() и starbar().
*/
// lethead2.c
#include <stdio.h> // команды препроцессора
#define NAME "GIGATHINK, INC." // команды препроцессора
#define ADDRESS "101 Megabuck Plaza" // команды препроцессора
#define PLACE "Megapolis, CA 94904" // команды препроцессора
#define WIDTH 40 // команды препроцессора
     // имя функции
void starbar(void); // прототип функции сообщает компилятору разновидность функций.
int main(void)
{
	starbar(); // использование функции приводит к выполнению функции.
	printf("%s\r\n", NAME);
	printf("%s\r\n", ADDRESS);
	printf("%s\r\n", PLACE);
	starbar(); // использование функции приводит к выполнению функции.
	return 0;
}
// тело функции
void starbar(void) // определение функции где в точности указано все, что делает функция.
{
	//оператор обьявления
	int count; // переменная count является локальной. это означает что она известна только этой функции.
	for(count = 1; count <= WIDTH; count++) // оператор управления циклом
		putchar('*'); // оператор функции
			putchar('\n'); // оператор функции
}
/*
Если думать о функции starbar() как о черном ящике, то ее действие заключается в выводе строки звездочек. Она не принимает входные данные, т.к. 
ей не нужна какая-либо информация от вызывающей функции. Она не предоставляет (т.е. не возвращает) информацию функции main(),  
поэтому starbar() не имеет возвращаемого значения. 
Короче говоря, функция starbar() не нуждается в каком-либо обмене данными с вызывающей функцией.
*/