/*
Предположим, что программа требует символьного ввода с помощью getchar() и числового ввода посредством scanf(). 
Каждая из этих функций хорошо делает свою работу, но смешивать их нелегко. 
Причина в том, что функция getchar() читает каждый символ, включая пробелы, символы табуляции и новой строки, в то время как scanf() 
при чтении чисел пропускает пробелы, символы табуляции и новой строки.
Чтобы продемонстрировать проблемы, которые при этом возникают, в листинге showchar1.c представлена программа, которая в качестве ввода считывает символ и два числа.
Затем она выводит таблицу с этим символом, имеющую столько строк и столбцов, сколько было указано во введенных числах.
*/
// showchar1.c -- программа с крупной проблемой ввода-вывода
#include <stdio.h>
void display(char cr, int lines, int width);
int main(void)
{
	int ch; // выводимый символ
	int rows, cols; // количество строк и столбцов
	printf("Enter a character and two integers:\r\n"); // Введите символ и два целых числа
	while((ch = getchar()) != '\n')
	{
		scanf("%d %d", &rows, &cols);
		display(ch, rows, cols);
		printf("Enter another character and two integers;\r\n"); // Введите еще один символ и два целых числа
		printf("Enter a newline to quit.\r\n"); // для завершения введите символ новой строки
	}
	printf("Bye.\r\n"); // программа завершена
	return 0;
}
void display(char cr, int lines, int width)
{
	int row, col;
	for(row = 1; row <= lines; row++)
	{
		for(col = 1; col <= width; col++)
			putchar(cr);
		putchar('\n'); // закончить строку и начать новую
	}
}
/*
Программа устроена так, что функция main() получает данные, а функция display () производит вывод.
*/