/*
Мы лишь слегка коснулись многообразного и удивительного мира указателей, но нас интересует применение указателей для решения задачи обмена данными. 
В листинге 9.15 представлена программа, в которой с помощью указателей обеспечивается работа функции interchange(). 
Давайте рассмотрим код, запустим ее и выясним, как она работает.
*/
// Листинг 9.15. Программа swap3.c
// swap3.c -- использование указателей для обмена значениями переменных
#include <stdio.h>
void interchange(int * u, int * v);
int main(void)
{
	int x = 5, y = 10;
	printf("Originally x = %d and y = %d.\r\n", x, y);
	interchange(&x, &y); // передача адресов в функию
	printf("Now x = %d and y = %d.\r\n", x, y);
	return 0;
}
void interchange(int * u, int * v)
{
	int temp;
	temp = *u; // temp получает значение, на которое указывает u
	*u = *v;
	*v = temp;
}