/*
рассмотрим несколько примеров, в которых задействована функция imax(), тесно связанная с irnin(). 
В листинге 9.4 показана программа, в которой функция irnax() объявляется устаревшим способом, а затем некорректно применяется.
*/
// misuse.c -- неправильное использование функции
#include <stdio.h>
int imax(); // объявление в старом стиле
int main(void)
{
	printf("The maximum of %d and %d is %d.\r\n", 3, 5, imax(3));
	printf("The maximum of %d and %d is %d.\r\n", 3, 5, imax(3.0, 5.0));
	return 0;
}
int imax(n, m)
int n, m;
{
	return(n > m ? n : m);
}
/*
В первом вызове printf() не указан один аргумент функции imax(), а во втором вызове используются аргументы с плавающей запятой вместо целочисленных.
*/