// Листинг 10.9 Программа day_mon3.c
// day_mon3.c -- использование формы записи с указателями
#include <stdio.h>
#define MONTHS 12
int main(void)
{
	// days — это адрес первого элемента массива
	int days[MONTHS] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
	for(int index = 0; index < MONTHS; index++)
		printf("Months %2d It has %d day (days).\r\n", index + 1, *(days + index)); // то же самое, что и days[index]
// индекс days + index — адрес элемента days[index] и *(days + index) — значение этого элемента, в точности как days[index].
	// Цикл по очереди ссылается на каждый элемент массива и выводит обнаруженное содержимое.
	return 0;
}
/*Основная цель кода в листинге 10.9 состояла в том, чтобы показать, что формы записи через массивы и через указатели являются эквивалентными.*/