/*Смысл выражения "поиска локально" зависит от реализации. 
Распространенные интерпретации предполагают помещение заголовочного файла в тот же каталог или папку, где находится исходный
код или фай проекта (если ваш компилятор имеет дело с ним). 
Содержимое заголовочного файла приведено в листинге 12.12.*/
// Листинг 12.12. Файл diceroll.h
// diceroll.h

extern int roll_count;
int roll_n_dice(int dice, int sides);

/*Данный заголовочный файл содержит прототипы функций и объявление extern.
Поскольку diceroll.с вкточает этот заголовочный файл, diceroll.с в действительности содержит два объявления переменной roll_count:
extern int roll_count; // из заголовочного файла
int roll_count = О; //из файла исходного кода
Можно иметь только одно определяющее объявление переменной. 
Однако объявление с ключевым словом extern является ссылочным, и таких объявлений может быть столько, сколько пожелаете.*/