/*Давайте немного расширим возможности и сделаем так, чтобы функция позволяла бросать произвольное количество костей и возвращала общее число очков. 
Это реализовано в листинге 12.11.*/
// листинг 12.11. Файл diceroll.c
/*diceroll.c -- эмуляция игры в кости*/
/*компилировать вместе с mandydice.c*/
#include "diceroll.h"
#include <stdio.h>
#include <stdlib.h> /*для библиотечной функции rand()*/
int roll_count = 0; /*внешнее связывание*/
static int rollem(int sides) /*закрытая для этого файла*/
{
	int roll;
	roll = rand() % sides + 1;
	++roll_count; /*подсчет вызовов функции*/
	return roll;
}
int roll_n_dice(int dice, int sides)
{
	int d;
	int total = 0;
	if(sides < 2)
	{
		printf("Need at least 2 sides.\r\n"); // Требуются, по меньшей мере, 2 грани
		return -2;
	}
	if(dice < 1)
	{
		printf("Need at least 1 die.\r\n"); // Требуется, по меньше мере, 1 кость.
		return -1;
	}
	for(d = 0; d < dice; d++)
		total += rollem(sides);
	return total;
}
/*В этом файле предпринято несколько действий. Во-первых, rollem() сделана функцией, закрытой для файла. 
Она выступает в качестве вспомогательной функции для roll_n_dice().
Во-вторых, для демонстрации работы внешнего связывания в файле объявлена внешняя переменная по имени roll_count, которая отслуживает количество вызовов функции rollem (). 
Пример несколько надуман, но он показывает, как работают внешние переменные.
В-третьих, файл содержит следующий оператор:
#include "diceroll.h"
В случае использования стандартных библиотечных функций, таких как rand().
вы включаете стандартный заголовочный файл(stdlib.h для rand()) вместо объявления функции. 
Причина в том, что такой заголовочный файл уже содержит корректное объявление. 
Мы эмулируем этот подход, предоставляя заголовочный файл diceroll.h для применения функции roll_n_dice(). 
Заключение имени файла в двойные кавычки, а не в угловые скобки, указывает компилятору на необходимость поиска этого файла локально, 
а не в стандартных местоположениях, которые используются для хранения стандартных заголовочных файлов.*/