/*Вспомните, что функция scanf() возвращает целочисленное значение, равное количеству успешно прочитанных элементов, или EOF при обнаружении конца файла.
В листинге 11.11 иллюстрируется работа функции scanf() , когда задана ширина поля.*/
// Листинг 11.11. Программа scan_str.c
// scan_str.c -- использование функции scanf()
#include <stdio.h>
int main(void)
{
	char name1[11], name2[11];
	int count;
	printf("Please enter 2 names.\r\n");
	count = scanf("%5s %10s", name1, name2);
	printf("I read the %d names %s and %s.\r\n", count, name1, name2);
	return 0;
}
/*В первом запуске оба имени вписываются в разрешенные предельные размеры.
Во втором запуске были прочитаны только первые 10 символов имени Миттельшпиль, поскольку мы применяем формат %10s. 
В третьем запуске в name2 попадают последние три буквы из имени Вениамин, т.к. второй ввод возобновляется там, где закончился первый ввод: в данном случае - внутри слова Вениамин.
В зависимости от природы желаемого ввода, для чтения текста с клавиатуры может
быть удобнее пользоваться функцией fgets(). Например, функция scanf() не особенно подходит для ввода названия книги или песни, если только название не состоит из одного слова. 
Типичным применением scanf() является чтение и преобразование смеси данных разных типов в некоторой стандартной форме. 
Например, если входная строка содержит название инструмента, складской номер и цену за штуку, то можно воспользоваться scanf() либо написать собственную функцию, 
которая будет выполнять проверку на предмет ошибок ввода.
Если вы хотите обрабатывать ввод по слову за раз, можете применять scanf().
Функция scanf() страдает тем же потенциальным недостатком, что и gets(): она может приводить к переполнению, если вводимое слово не умещается в целевую область памяти. 
Но для предотвращения такого переполнения можно использовать параметр ширины поля в спецификаторе %s.*/