/*Ранее мы говорили, что если ptsl и pts2 — указатели на строки, то оператор pts2 = ptsl; копирует только адрес строки, но не саму строку. 
Тем не менее, предположим, что вы хотите скопировать строку. В таком случае можете воспользоваться функцией strcpy(). 
Код в листинге 11.25 предлагает пользователю ввести слова, начинающиеся с буквы к. 
Эта программа копирует ввод во временный массив, и, если первой буквой является к, программа использует функцию strcpy() 
для копирования этой строки из временного файла в место ее постоянного хранения. 
Функция strcpy() предстааляет собой строковый эквивалент оператора присваивания.*/
// Листинг 11.25. Программа copy1.c 
// copy1.c -- Демонстрация использования strcpy()
#include <stdio.h>
#include <string.h> // объявление strcpy()
#define SIZE 40
#define LIM 5
char *s_gets(char *st, int n);
int main(void)
{
	char qwords[LIM][SIZE];
	char temp[SIZE];
	int i = 0;
	printf("Enter %d words beginning with q:\r\n", LIM); // Введите слов, которые начинаются с буквы q
	while(i < LIM && s_gets(temp, SIZE))
	{
		if(temp[0] != 'q')
			printf("%s doesn't begin with q!\r\n", temp); // не начинается с буквы q
		else
		{
			strcpy(qwords[i], temp);
			i++;
		}
	}
	puts("Here are the words accepted:"); // список принятых слов
	for(i = 0; i < LIM; i++)
		puts(qwords[i]);
	return 0;
}
char *s_gets(char *st, int n)
{
	char *ret_val;
	int i = 0;
	ret_val = fgets(st, n, stdin);
	if(ret_val)
	{
		while(st[i] != '\n' && st[i] != '\0')
			i++;
		if(st[i] == '\n')
			st[i] = '\0';
		else // требуется наличие words[i] == '\0'
			while(getchar() != '\n')
				continue;
	}
	return ret_val;
}
/*Короче говоря, функция strcpy() принимает в качестве аргументов два указателя на строки. 
Второй указатель, который ссылается на исходную строку, может быть объявленным указателем, именем массива или строковой константой. 
Первый указатель, ссылающийся на копию, должен указывать на объект данных, такой как массив с размером, достаточным для хранения этой строки. 
Вспомните, что объявление массива приводит к выделению пространства под данные, а при объявлении указателя пространство выделяется только для размещения одного адреса.*/