/*
Довольно широкое толкование понятия истины в С может приводить к затруднениям.
Например, давайте внесем одно тонкое изменение в программу
*/
// неправильное применение операции =
// приводит к возникновению бесконечного цикла
#include <stdio.h>
int main (void)
{
	long num;
	long sum = 0L;
	int status;
	printf("Please enter an integer to be summed "); // введите целое число для последующего суммирования
	printf("(q to quit): "); // или q для завершения программы
	status = scanf("%ld", &num);
	while (status = 1) // = вместо ==
	{
		sum = sum + num;
		printf("Please enter next integer (q to quit): "); // Введите следующее целое число (или q для завершения программы)
		status = scanf("%ld", &num);
	}
	printf("Those integers sum to %ld.\r\n", sum); // Сумма введенных целых чисел равна
	return 0;
}
/*
К такому плачевному результату привело изменение, внесенное в условие проверки оператора while, 
когда выражение status == 1 было заменено выражением status = 1.
Второе выражение — это оператор присваивания, который устанавливает переменную status в 1. 
Более того, значением оператора присваивания является значение его левой части, поэтому status = 1 имеет то же самое числовое значение 1.
Следовательно, с практической точки зрения этот цикл while дает такой же результат, как и while ( 1) — т.е. цикл никогда не завершится. 
В случае ввода q переменная status устанавливается в О, однако при проверке условия цикла status получает значение 1 и инициирует следующую итерацию.
*/ 