1. Чем отличается фактический аргумент от формального параметра?
	фактический аргумент - это выражение, указанное в круглых скобках при вызове функции.
	формальный параметр - это переменная, объвленная в заголовке определения функциий.
	;

2. Напишите заголовки ANSI С для указанных ниже функций. Речь идет только о заголовках, но не о телах.
а. Функция donut() принимает аргумент int и выводит количество нулей, соответствующее значению этого аргумента.
void donut(int a)
б. Функция gear() принимает два аргумента int и возвращает значение типа int.
int gear(int a, int b)
в. Функция guess() не принимает аргументов и возвращает значение типа int.
int guess(void)
г. Функция stuff_ it() принимает значение double и адрес переменной double и запоминает первое значение в заданной ячейке.
void stuff_it(double a, double *a)
	;

3. Напишите заголовки ANSI С для указанных ниже функций. Речь идет только о заголовках, а не о телах.
а. Функция n_to_char() принимает аргумент int и возвращает значение типа char.
char n_to_char(int a)
б. Функция digits() принимает аргументы double и int и возвращает значение типа int.
int digits(double a, int b)
в. Функция which() принимает в качестве аргументов два адреса значений double и возвращает адрес значения типа double.
double *which(double *a, double *b)
г. Функция random() не принимает аргументов и возвращает значение типа int.
int random(void)
;

4. Напишите функцию, которая возвращает сумму двух целых чисел.
int name(int a, int b)
{
	return a + b;
}

5. Что придется изменить, если вообще придется, чтобы функция из вопроса 4 взамен суммировала два числа типа double?
double name (double a, double b)
{
	return a + b;
}

6. Напишите функцию по имени alter(), которая принимает две переменные int, х и у, и устанавливает их значения, соответственно, в сумму и разность х и у.;
void alter(int *x, int *y)
{
	int temp;
	temp = *pa + *pb;
	*pb = *pa - *pb;
	*pa = temp;
}
;
7. Нет ли ошибок в следующем определении функции?
	void salami(num)
	(
	int num, count;
	for (count = 1; count <= num; num++)
	printf(" Здравствуйте!\n"); -
	)
	void salami()
	{
		int num = 10;
		int count;
		for(count = 1; count <= num; count++)
			printf("Hello!\r\n");
		return;
	}
Да, ошибки присутствуют. Аргумент num должен быть объявлен в списке аргументов функции salami (), 
а не после фигурной скобки. Кроме того, вместо num++ должно быть count++.
;
8. 
Ниже показано одно возможное решение:
int largest(int а, int Ь, int с)
{
	int max = а;
	if (Ь > max)
		max = Ь;
	if (с > max)
		max = с;
	return max;
}
9. Задан следующий вывод: 
Выберите один из следующих вариантов:
1) копировать файлы 2) переместить файлы
3) удалить файлы 	4) выйти из программы
Введите номер выбранного варианта:
а. Напишите функцию, которая выводит на экран меню из четырех пронумерованных
вариантов и предлагает выбрать один из них. (Вывод должен иметь
показанный выше вид.)
#include <stdio.h>
int main(void)
{
	int enter;
	printf("Select one of the following options:\r\n"); // Выберите один из следующих вариантов
	printf("1) copy the files 		2) move the files\r\n"); // 1) копировать файлы  	2) переместить файлы
	printf("3) delete files 		4) to leave the program\r\n"); // 3) удалить файлы 		4) выйти из программы
	printf("Enter the number of the selected option: "); // Введите номер выбранного варианта:
	scanf("%d", &enter);
	switch(enter)
	{
	case 1:
		printf("1) copy the files\r\n");
		break;
	case 2:
		printf("2) move the files\r\n");
		break;
	case 3:
		printf("3) delete files\r\n");
		break;
	case 4:
		printf("4) to leave the program\r\n");
		break;
		default:
		printf("Invalid entry!\r\n");
	}
	return 0;
}
б. Напишите функцию, которая имеет два аргумента int: нижний предел и верхний предел. 
Функция должна читать целое число из входных данных. Если это число выходит за указанные пределы, функция должна снова вывести меню
(используя функцию из части а)), чтобы повторно предложить пользователю ввести новое значение. 
Если введенное целое значение попадает в рамки пределов, функция должна возвратить его в вызывающую функцию. 
Ввод нецелочисленного значения должен приводить к возвращению функцией значения, соответствующего выходу из программы (4).