/*Поскольку функция fgets() обрабатывает символ новой строки как часть строки (при условии, что строка ввода имеет соответствующую длину), 
ее часто применяют совместно с функцией fputs(), которая работает подобно puts(), но не добавляет автоматически символ новой строки. 
Функция fputs() принимает второй аргумент, указывающий на файл, в который должна производиться запись. 
Для вывода на дисплей можно использовать аргумент stdout (от standard output - стандартный вывод).
В листинге 11.7 иллюстрируется поведение функций fgets() и fputs().*/

// Листинг 11.7. Программа fgets1.c
// fgets1.c -- использование функций fgets() и fputs()
#include <stdio.h>
#define STLEN 15
int main(void)
{
	char words[STLEN];
	puts("enter a string, please.");
	fgets(words, STLEN, stdin); // Функция fgets() возвращает указатель на char.
	printf("Your string twice (puts(), then fputs():\r\n");
	puts(words);
	fputs(words, stdout);
	puts("Enter another string, please.");
	fgets(words, STLEN, stdin);
	printf("Your string twice (puts(), then fputs()):\r\n");
	puts(words);
	fputs(words, stdout);
	puts("Done.");
	return 0;
}
/*Первая строка ввода, шарлотка, является достаточно короткой, чтобы функция fgets() прочитало ее и сохранила шарлотка \n\0 в массиве. 
Поэтому, когда функция puts() отображает строку и добавляет в вывод собственный символ новой строки, она порождает пустую строку вывода после строки шарлотка. 
Так как fputs() не добавляет символа новой строки, она не создаст новую строку.*/

/*Длина второй строки ввода, клубничное песочное печенье, превышает лимит на размер, поэтому fgets() считывает первые 14 символов и 
сохраняет в массиве строку клубничное пес\0. И снова функция puts() добавляет символ новой строки в вывод, а fputs() не делает этого.*/