/*Однако если функция встречает конец файла, она возвращает специальный указатель, называемый нулевым. 
Такой указатель гарантированно не ссылается на реальные данные, поэтому может применяться для отражения особого случая. 
В коде он может быть представлен цифрой 0 или, что более распространено в С, макросом NULL. 
(Функция возвращает NULL также в ситуации, когда произошла какая-то ошибка чтения.) 
В листинге 11.8 показан простой цикл, который читает и повторяет текст до тех пор, 
пока функция fgets() не встретит конец файла или не выполнит считывание пустой строки — т.е. строки, первым символом которой является символ новой строки.*/
// Листинг 11.8. Программа fgets2.c
// fgets2.c -- использование функций fgets() и fputs()
#include <stdio.h>
#define STLEN 10
int main(void)
{
	char words[STLEN];
	puts("Enter strings (empty line to quit):");
	while(fgets(words, STLEN, stdin) != NULL && words[0] != '\n')
		fputs(words, stdout);
	puts("Done.");
	return 0;
}

/*Интересно отметить, что хотя значение STLEN равно 10, похоже, программа не испытывает проблем при обработке строк ввода, длина которых значительно превышает этот предел. 
Дело в том, что в данной программе функция fgets() читает STLEN-1 (т.е. 9) символов за раз. Поэтому она начинает с чтения строки “Кстати го”, сохраняя ее как Кстати го\0. 
Затем fputs() отображает эту строку, но при этом не переходит на следующую строку вывода. 
Далее функция fgets() возобновляет чтение с того места, где она остановилась, и считывает “воря, фуп ”, сохранив ее как воря, фун\0.
Функция fputs() отображает эту строку в той же строке, в которой она находилась ранее. 
Затем fgets() возобновляет чтение ввода продолжая до тех пор, пока не останется прочитать только “()\п”; 
функция fgets() сохраняет строку () \n \0, функция fputs() отображает ее, а внутренний символ новой строки приводит к перемещению курсора на следующую строку.*/

/*В системе исполыуется буферизированный ввод-вывод. Это означает, что введенные данные сохраняются во временной памяти (буфере) до тех пор, пока не будет
нажата клавиша <Enter>. В результате этого к введенным данным добавляется символ новой строки, и вся строка передается функции fgets(). 
При выводе функция fputs() передает символы в другой буфер, и после отправки символа новой строки содержимое буфера передается дисплею.*/