/*В листинге 11.9 к этим базовым идеям добавляется дополнительная проверка, что дает в итоге код, который читает строки ввода, удаляет сохраненные символы новой
строки, если таковые имеются, и отбрасывает часть строки, которая не умещается в выделенную область памяти.*/
// Листинг 11.9. Программа fgets3.c
// fgets3.c -- использование функции fgets()
#include <stdio.h>
#define STLEN 10
int main(void)
{
	char words[STLEN];
	int i;
	puts("Enter strings (empty line to quit):"); // Введите строки (или пустую строку для выхода из программы)
	while(fgets(words, STLEN, stdin) != NULL && words[0] != '\n')
	{
		i = 0;
		while(words[i] != '\n' && words[i] != '\0')
			i++;
		if(words[i] == '\n')
			words[i] == '\0';
		else // Требуется наличие words[i] == '\0'
			while(getchar() != '\n')
				continue;
			puts(words);
	}
	puts("Done.");
	return 0;
}

/*Цикл
while(words[i] != '\n' && words[i] != '\0')
i++;
выполняет проход по строке до тех пор, пока не встретит символ новой строки или нулевой символ (в зависимости от того, что произойдет раньше). 
Если найденный символ является символом новой строки, то следующий за циклом оператор if заменяет его нулевым символом. 
В противном случае часть else отбрасывает остаток строки ввода.*/