/*Функция puts() очень проста в использовании. Ей нужно только передать в качестве артумента адрес строки. 
В листинге 11.12 демонстрируется несколько способов из множества доступных.*/
// Листинг 11.12. Программа put_out.c
// put_out.c -- использование функции puts()
#include <stdio.h>
#define DEF "I am a #defined string." // Я - строка, определенная директивой #define
int main(void)
{
	char str1[80] = "An array was initialized to me."; // Массив был инициализирован моим значением.
	const char *str2 = "A pointer was initialized to me."; // Указатель был инициализирован моим значением.
	puts("I'm an argument to puts()."); // Я - аргумент функции puts()
	puts(DEF);
	puts(str1);
	puts(str2);
	puts(&str1[5]);
	puts(str2 + 4);
	return 0;
}
/*Как и в предшествующих примерах, каждая строка выводится в собственной строке, потому что при отображении строки функция puts() автоматически добавляет символ новой строки.
Этот пример напоминает, что фразы, заключенные в двойные кавычки, представляют собой строковые констант и трактуются как адреса. 
Кроме того, имена строковых массивов также считаются адресами. Выражение &strl[5] — это адрес шестого элемента в массиве strl. Этот элемент содержит символ 'в', и именно он puts()
применяет в качестве начальной точки. 
Аналогично, str2 + 4 указывает на ячейку памяти, содержащую второй символ 'а' из строки "Указатель", поэтому вывод начинается с него.*/