/*Как функция puts() узнает, когда остановиться? Она прекращает вывод, когда встречает нулевой символ, так что лучше, чтобы он был в строке. 
Не повторяйте ошибку, проиллюстрированную в листинге 11.13!*/
// Листинг 11.13. Программа nono.c
// Программа nono.c -- не делайте так!
#include <stdio.h>
int main(void)
{
	char side_a[] = "Side A";
	char dont[] = { 'W', 'O', 'W', '!' };
	char side_b[] = "Side B";
	puts(dont); // dont не является строкой
	return 0;
}
/*Поскольку в массиве dont отсутствует завершающий нулевой символ, он не является строкой, поэтому функция puts() не знает, где остановиться. 
Она будет выводить содержимое ячеек памяти, следующих за dont, пока не обнаружит нулевой символ где- то в другом месте. 
Чтобы гарантировать, что нулевой символ не окажется слишком далеко, массив dont в программе хранится между двумя настоящими строками.*/
/*Использованный здесь компилятор разместил в памяти массив side_a после массива dont, так что функция puts() продолжает движение до тех пор, пока не наталкивается
на нулевой символ в массиве side_a. 
В зависимости от того, как ваш компилятор размещает данные в памяти, вы можете получить другие результаты. 
Что будет, если из программы убрать массивы side_a и side_b? Обычно в памяти содержится
много нулей, и при некоторой доле везения функция puts() сможет найти один из них довольно быстро, однако не стоит на это полагаться.*/