/*Вспомните, что при чтении строки функция scanf() и спецификатор %s обеспечивают считывание только одного слова. 
Однако часто желательно, чтобы программа могла читать сразу всю вводимую строку, а не одиночное слово. 
Именно такой цели напротяжении многих лет служила функция gets(). Это простая и легкая в использовании функция. 
Она читает всю строку вплоть до символа новой строки, отбрасывает этот символ и сохраняет остальные символы, добавляя нулевой символ, чтобы образовать строку С. 
Часто эта функция применяется в сочетании с функцией puts(), которая отображает строку с добавлением в конце символа новой строки. 
В листинге 11.6 приведен короткий пример.*/

// Листинг 11.6. Программа getsputs.c
// getsputs.c -- использование функций gets() и puts()
#include <stdio.h>
#define STLEN 81
int main(void)
{
	char words[STLEN];
	puts("Enter a string, please.");
	gets(words);
	printf("Your string twice:\r\n");
	printf("%s\r\n", words);
	puts(words);
	puts("Done.");
	return 0;
}
/*Обратите внимание, что вся введенная строка кроме символа новой строки сохраняется в массиве words, 
а вызов puts(words) обеспечивает такой же эффект, как и вызовp printf("%s\n", words).*/