/*
напишите программу, которая читает ввод как поток символов, пока не встретит EOF. 
Программа должна выводить каждый введенный символ и его десятичный код ASCII. 
Следует отметить, что в кодировке ASCII символы, предшествующие пробелу, являются непечатаемыми. 
Трактуйте их особым образом. Если непечатаемым символом является символ новой строки или символ табуляции, выводите, соответственно, \n или \ t. 
В противном случае воспользуйтесь нотацией управляющих символов. 
Например, ASCII-код 1 — это комбинация <Ctrl+A>, которую можно отобразить как "А. Обратите внимание, что ASCII-код символа А представляет собой значение <Ctrl+A> плюс 64. 
Аналогичная зависимость имеется и для других непечатаемых символов. Выводите по 10 пар в строке, кроме случая, когда встречается символ новой строки. 
(На заметку: операционная система может иметь специальные интерпретации для некоторых управляющих символов и не допускать их попадания в программу.)
*/
#include <stdio.h>
int main(void)
{
	int ch;
	printf("Enter the characters\r\n");
	while((ch = getchar()) != EOF && ch != '#')
	{
	putchar(ch);
	printf(" symbol = %d.\r\n", ch);
	}
	return 0;
}