/*Важно понимать, что решение прекратить или продолжить выполнение цикла
принимается только после того, как вычислено условие проверки. В качестве примера
рассмотрим программу */

// когда цикл завершается
#include <stdio.h>
int main (void)
{
	int n = 5;
	while (n++ < 7) 					// строка 7
	{
		printf("n = %d\r\n", n);
		n++;							// строка 10
		printf("Now n = %d\r\n", n);	// строка 11
	}
	printf("The loop has finished.\r\n"); // цикл завершен
	return 0;
}
/*Переменная n впервые получает значение 7 в строке 10 во время второй итерации цикла. 
Однако цикл не прекращается немедленно. Вместо этого завершается текущая
итерация (строка 11) и выход из цикла происходит только после того, как условное
выражение в строке 7 будет вычислено в третий раз. 
(Во время первой проверки переменная n имела значение 5, а во время второй — значение 6.) */ 