/*
В данном примере выводятся значения двух выражений отношения, одно из которых истинное, а другое — ложное.
*/

// истинные и ложные значения в языке С
#include <stdio.h>
int main (void)
{
	int true_val, false_val;
	true_val = (10 > 2);   // значение истинного отношения
	false_val = (10 == 2); // значения ложного отношения 
	printf("true = %d; false = %d\r\n", true_val, false_val);
	return 0;
}
/*
двум переменным присваиваются значения двух выражений отношений.
С целью простоты переменной true_ val присваивается значение истинного выражения, а переменной false_val - значение ложного выражения 
В языке С истинное выражение имеет значение 1, а ложное выражение — О.
*/
