1. Каким будет значение quack после выполнения каждой строки кода? 
   Каждый последних пяти операторов использует значение quack, сгенерированное прешествующим оператором.
   int quack = 2 ~ 2;
   	   quack += 5 ~ 7;
   	   quack *= 10 ~ 70;
   	   quack -= 6 ~ 64;
   	   quack /= 8 ~ 8;
   	   quack %= 3 ~ 2;
3. Запишите выражение для каждого из следующих условий проверки.
	a. x > 5
	б. scanf("%lf", &x) != 1
	в. x == 5
4. Запишите выражение для каждого из следующих условий проверки.
	a. scanf("%d", &b) == 1
	б. x != 5
	в. x >= 20
10. Взгляните на следующее объявление: double mint[10];
а. Какое имя назначено массиву? ~ mint
б. Сколько элементов в массиве? ~ [10]
в. Какие виды значений могут храниться в каждом элементе массива? double
г. Что из перечисленного ниже является корректным использованием функции scanf() с этим массивом?
• scanf("%lf", mint [2])
• scanf("%lf", &mint[2]) ~ +
• scanf("%lf", &mint)
12. Вы хотите написать функцию, которая возвращает значение типа long. Что должно включать определение этой функции?
void ab (void)

Определение должно объявить возвращаемый тип как long и содержать оператор return, который возвращает значение long.

13. Определите функцию, которая принимает аргумент типа int и возвращает результат его возведения в квадрат как значение типа long.
Приведение типа num к long гарантирует выполнение вычислений с типом long, а не int. 
В системе с 16-битным int умножение двух значений типа int порождает результат, который перед возвратом значения усекается до типа int,
что может приводить к потере данных.
long square(int num)
{
return ((long) num) * num;
}