/* Можно даже оставить одно или несколько выражений пустыми ( но не опускайте точки с запятой). 
Обеспечьте наличие в цикле оператора, который в конечном итоге приведет к завершению цикла. */
#include <stdio.h>
int main (void)
{
	int ans, n;
	ans = 2;
	for (n = 3; ans <= 25; )
		ans = ans * n;
	printf("n = %d; ans = %d.\r\n", n, ans);
	return 0;
}
/* Значение переменной n в цикле остается равным 3. Переменная ans начинается со значения 2, затем увеличивается до 6 и 18, а в конечном итоге получает значение 54. 
(Значение 18 меньше, чем 25, так что цикл for выполняет на одну итерацию больше, умножая 18 на 3 для получения 54.) 
Кстати, пустое управляющее выражение, находящееся посередине, считается истинным, 
поэтому приведенный ниже цикл выполняется бесконечно:
for ( ; ; )
printf("Требуется определенное действие.\n"); */