/* В качестве третьего выражения можно использовать любое допустимое выражение.
Что бы вы здесь не поместили, это будет обновляться на каждой интерации. */
#include <stdio.h>
int main (void)
{
	int x;
	int y = 55;
	for (x = 1; y <= 75; y = (++x * 5) + 50)
		printf("%10d %10d\r\n", x, y);
	return 0;
}
// Этот цикл выводит значения переменной x и алгебраического выражения ++x * 5 + 50
/* Обратите внимание, что в проверке участвует переменная y, а не x. В каждом из трех выражений, управляющих циклом for,
могут применяться разные переменные.(Следует отметить, что хотя этот пример является допустимым, он не соответсвует хорошему стилю программирования.
Программа могла бы стать более ясной, если не смешивать процесс обновления с алгебраическими вычислениями.)