/* Первое выражение не обязательно должо инициализировать переменную.
вместо это им могла бы быть какая-то разновидность оператора printf().
Просто запомните, что первое выражение вычисляется или выполняется только один раз, до того как начнут выполняться другие части цикла. */
#include <stdio.h>
int main (void)
{
	int num = 0;
	for (printf("Keep entering numbers!\r\n"); num != 6; )
		scanf("%d", &num);
	printf("That's the one I want!\r\n");
	return 0;
}
/* Этот фрагмент кода один раз выводит первое сообщение, а затем продолжает принимать числа до тех пор, пока вы не введете 6 */ 