/*
При условии, что переменная value имеет тип int, определите, какой будет получен в результате выполнения следующего цикла:
	for ( value = 36; value > О; value /= 2)
		printf("%3d", value);
		результат деление 36 / 2;
Какие проблемы могли бы возникнуть, если бы переменная value имела double вместо int?

Если бы переменная value имела тип double, то результат проверки условия оставался бы истинным даже при значениях value, меньших 1. 
Выполнение цикла продолжалось бы до тех пор, пока потеря значимости при вычислениях с плавающей запятой не привела бы к получению значения О. 
Кроме того, в этом случае выбор спецификатора %3d был бы неправильным.
*/
#include <stdio.h>
int main (void)
{
	int value;
	for (value = 36; value > 0; value /=2)
		printf("%3d", value);
	return 0;
}