/*
Воспользуйтесь вложенными циклами, чтобы написать программу, которая выводит следующую последовательность символов:
$ 
$$
$$$
$$$$
$$$$$
*/
#include <stdio.h>

int main (void)
{
	int a, b;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= a; b++)
		printf("$");
		printf("\r\n");
	}
	return 0;
}