/*
Напишите программу, которая запрашивает ввод нижнего и верхнего пределов последовательности целых чисел, вычисляет сумму всех 
квадратов целых чисел, начиная с квадрата нижнего целочисленного предела и заканчивая квадратом верхнего целочисленного предела, 
после чего отображает результат на экране. Затем программа должна запрашивать ввод следующих предельных значений и отображать 
ответ, пока пользователь не введет значение верхнего предела, который меньше или равен нижнему пределу. 
Результаты выполнения программы должны выглядеть следующим образом:
Введите нижний и верхний целочисленные пределы: 5 9
Сумма квадратов целых чисел от 25 до 81 равна 255
Введите следующую комбинацию пределов: З 25
Сумма квадратов целых чисел от 9 до 625 равна 95
Введите следующую комбинацию пределов: 5 5
Работа завершена
*/
#include <stdio.h>
#include <math.h>
int calc(int, int);
int main(void)
{
    int lower, upper, result;
    printf("Enter lower and upper integer limits: ");
    while (scanf("%d%d", &lower, &upper) == 2 && lower < upper)
    {
        printf("The sums of the squares from %hd to %hd is %hd\r\n", pow(lower, 2), pow(upper, 2), calc(lower, upper));
        printf("Enter lower and upper integer limits: ");
    }
    return 0;
}
int calc(int m, int n)
{
    int sum;
    int i;
    for (i = m; i <= n; i++)
    {
        sum += pow(i, 2);
    }
    return sum;
}