/*
Воспользуйтесь вложенными циклами, чтобы написать программу, которая выводит следующую последовательность символов:
А
BC
DEF
GНIJ
KLMNO
PQRSTU
Если в вашей системе не используется кодировка, в которой буквы представлены в числовом порядке, см. примечание в упражнении 3.
*/ 
#include <stdio.h>
int main (void)
{
	char a;
	int b;
	for (b = 0; b <= 6; b++)
	{
		for(a = 'A'; a < ('A' + b); a++)
		printf("%c", a);
		printf("\r\n");
	}
	return 0;
}