/* 
Операции отношений могут также применяться с числами с плавающей запятой.
Однако имейте в виду, что при сравнении чисел с плавающей вы должны использовать
только операции < и >. Это объясняется тем, из-за ошибок округления два числа могут оказаться неравными, 
хотя логически они должны быть равны. 
Например, совершенно очевидно, что произведение чисел 3 и 1/3 равно 1.0. 
Но если выразить число 1/3 в виде десятичной дроби с шестью значащими цифрами, то произведением
будет .999999, что не равно в точности 1. 
Функция fabs (), объявленная в заголовочном
файле <math.h>, может быть удобной при проверках, в которых участвуют числа с плавающей запятой. 
Эта функция возвращает абсолютное значение величины с плавающей запятой, т.е. значение без алгебраического знака. 
Например, с помощью кода, подобного показанному в листинге 6.5, можно проверить, насколько число близко к желаемому результату. 
*/
// сравнение чисел с плавающей запятой
#include <math.h>
#include <stdio.h>
int main (void)
{
	const double ANSWER = 3.14159;
	double response;
	printf("What is the value of pi?\r\n"); // каково значения числа pi?
	scanf("%lf", &response);
	while (fabs(response - ANSWER) > 0.0001)
	{
		printf("Try again!\r\n"); // Введите значение еще раз
		scanf("%lf", &response);
	}
	printf("Close enough!\r\n"); // Достаточно близко!
	return 0;
}
/*
В цикле продолжается уточнение ответа до тех пор, пока разница между ответом и корректным значением не окажется в пределах 0.0001
Каждое условное выражение получает оценку “истина” или “ложь” (но не “может быть").
*/