/*
Вы выбираете число, а компьютер пытается его угадать. В программе применяется довольно скучный метод, но мы сосредоточимся на вводе-выводе, а не на алгоритме. 
В листинге guess.c приведена начальная версия программы, которая требует дальнейшей доработки.
*/
// guess.c -- неэффективное и чреватое ошибками угадывание числа
#include <stdio.h>
int main(void)
{
	char response;
	int guess = 1;
	printf("Pick an integer from 1 to 100. I will tye to quess "); // Виберите целое число в интервале от 1 до 100. Я попробую угадать
	printf("it.\r\nRespond with a y if my quess is right and with"); // Нажмите клавишу y, если моя догадка верна и
	printf("an n if it is wrong.\r\n");// клавишу n в противном случае.
	printf("Uh...is your number %d?\r\n", guess); // Вашим числом является
	while((response = getchar()) != 'y') // получить ответ, сравнить c y
	{
		if(response == 'n')
		printf("Well, then, is it %d?\r\n", ++guess); // Ладно, тогда это
	else
		printf("Sorry, I understand only y or n.\r\n"); // Принимаются только варианты y или n
	while(getchar() != '\n')
	continue; // пропустить оставшуюся часть входной строки
	}
	printf("I knew i could do it!\r\n"); // Я знал, что у меня получится!
	return 0;
}
/*
При написании интерактивных программ вы должны стараться предвосхищать возможности нарушения инструкций пользователями. Программу необходимо проектировать так, 
чтобы она элегантно обрабатывала ошибки пользователей. Пользователей следует уведомить о допущенной ошибке и дать дополнительный шанс.
Разумеется, вы должны предоставить пользователю четкие инструкции, однако независимо от того, насколько они ясны, всегда найдутся те, 
кто интерпретирует их неправильно, а затем обвинит вас в составлении непонятных инструкций.
*/ 

/* упрощенная версия
#include <stdio.h>
int main(void)
{
	int guess = 1;
	printf("Pick an integer from 1 to 100. I will tye to quess "); // Виберите целое число в интервале от 1 до 100. Я попробую угадать
	printf("it.\r\nRespond with a y if my quess is right and with"); // Нажмите клавишу y, если моя догадка верна и
	printf("an n if it is wrong.\r\n");// клавишу n в противном случае.
	printf("Uh...is your number %d?\r\n", guess); // Вашим числом является
	while(getchar() != 'y') // получить ответ, сравнить c y
	printf("Well, then, is it %d?\r\n", ++guess); // Ладно, тогда это
	printf("I knew i could do it!\r\n"); // Я знал, что у меня получится!
	return 0;
}
*/