/*Командная строка — это место, где вы вводите с клавиатуры информацию для запуска своей программы в среде командной строки. 
Предположим, что программа хранится в файле по имени fuss.
Тогда командная строка для ее запуска в среде Unix может выглядеть так:
$ fuss
А вот ее вид для режима командной строки Windows:
С> fuss
Аргументы командная строки — это дополнительные элементы в той же самой строке, например:
$ fuss -r Ginger
Программа на С может считывать эти дополнительные элементы для собственных целей (рис. 11.7).
Программа на С читает эти элементы, используя артументы функции main().
В листинге 11.31 приведен типичный пример.*/

// Листинг 11.31.Программа repeat.c
// repeat.c -- функция main() c аргументами
#include <stdio.h>
int main(int argc, char *argv[])
{
	int count;
	printf("The command line has %d arguments:\r\n", argc - 1);
	for(count = 1; count < argc; count++)
		printf("%d: %s\r\n", count, argv[count]);
	printf("\r\n");
	return 0;
}

/*Компиляторы С позволяют функции main() не принимать аргументов либо иметь два аргумента. 
(Некоторые реализации разрешают принимать дополнительные аргументы, но это считается расширением стандарта.) 
В случае двух аргументов первым является количество элементов в командной строке. 
По традиции (хотя и не обязательно) этот аргумент типа int называется argc (от argument count — количество аргументов). 
Для выяснения, где заканчивается один элемент и начинается другой, система применяет пробелы. 
Таким образом, в запуске repeat присутствуют четыре элемента, включая имя команды, а в запуске fuss — три. 
Программа сохраняет элементы командной строки в памяти и помещает адреса элементов в массив указателей.
Адрес этого массива сохраняется во втором аргументе. По соглашению этот указатель на указатели имеет имя argv (от argument valms — значения аргументов). 
Когда возможно (в некоторых операционных системах это не разрешено), элементу argv[О] присваивается имя самой программы. 
Затем элементу argv[1] присваивается первый из следующих далее элементов командной строки и т.д. 
В рассматриваемом примере мы имеем следующие отношения:
argv[О] указывает на repeat (в большинстве систем)
argv[1] указывает на Все
argv[2] указывает на будет
argv[3] указывает на хорошо
В листинге 11.31 с помощью цикла for элементы командной строки выводятся по очереди. 
Вспомните, что спецификатор %s для printf() ожидает предоставления в аргументе адреса строки. 
Каждый элемент — argv[О], argv[1] и т.д. — является таким адресом.*/

/*Многие среды, включая Unix и BOS, позволяют использовать кавычки для объединения нескольких слов в один аргумент. 
Например, команда
repeat "Я был здесь" давно присваивает строку "Я бып здесь" элементу argv[1], а строку "давно" — элементу argv[2].*/