/*
Во время применения оператора while имейте в виду, что частью цикла является
только один оператор, простой или составной, который следует за условием проверки.
Отступы предназначены для помощи читателю, а не компьютеру 
*/

// следите за фигурными скобками
// неправильное кодирование может приводить к бесконечному циклу
#include <stdio.h>
int main (void)
{
	int n = 0;
	while (n < 3)
		printf("n is %d\r\n", n);
		n++;
		printf("That's all this program does\r\n");
		return 0;
}
/*
Хотя в этом примере оператор n++; набран с отступом, он не заключен в фигурные скобки вместе с предыдущим оператором. 
Таким образом, в состав цикла входит только один оператор вывода, находящийся непосредственно после условия проверки.
Переменная n никогда не изменится, условие n < З навсегда останется истинным,
и вы получите цикл, который будет продолжать выводить сообщение дотех пор, пока
вы не прервете выполнение программы. 
Это пример бесконечного цикла, из которого нельзя выйти без внешнего вмешательства 
*/ 