/*Возможно, вы уже заметили, что в этом обсуждении строк мы периодически ссылаемся на указатели. 
Большинство операций со строками в С фактически работают с указателями. В качестве примера рассмотрим короткую программу в листинге 11.5.*/
// Листинг 11.5. Программа p_and_s.c
// p_and_s.c -- указатели и строки
#include <stdio.h>
int main(void)
{
	const char *mesg = "Don't be a fool!";
	const char *copy;
	copy = mesg;
	printf("%s\r\n", copy);
	printf("mesg = %s; &mesg = %p; value = %p\r\n", mesg, &mesg, mesg);
	printf("copy = %s; &copy = %p; copy = %p\r\n", copy, &copy, copy);
	return 0;
}
/*mesg и сору выводятся в виде строки (%s). Здесь нет никакого сюрприза; все строки выглядят как "Не позволяйте себя запутать!".
Следующий элемент в каждой строке представляет адрес определенного указателя.
Для конкретного запуска два указателя mesg и сору хранятся, соответственно, в ячейках Ox0012ff48 и Ox0012ff44.
Теперь обратите внимание на завершающий элемент по имени value. Это значение заданного указателя. 
Значением указателя является адрес, который он содержит.
Как видите, mesg указывает на ячейку Ох0040а000, и то же самое можно сказать о сору. Следовательно, сама строка не копировалась. 
Оператор сору = mesg; всего лишь создает второй указатель, ссылающийся на ту же строку.*/