/*В листинге 10.10 показана программа, в которой применяется функция sum(). Чтобы отразить интересный факт, касающийся аргументов типа массива, в ней также
выводится размер исходного массива и размер параметра функции, представляющего массив. 
(Если ваш компилятор не поддерживает спецификатор %zd, для вывода значений функции sizeof используйте спецификатор %и или, возможно, %1и.)*/
// sum_sum_arr1.c -- сумаа элементов массива
// %u or %lu, если %zd не работает.
#include <stdio.h>
#define SIZE 10
// ar — указатель на первый элемент массива marbles, а связь между массивами и указателями в языке С позволяет применять форму записи массива вместе с указателем ar.
int sum(int ar[], int n);
int main(void)
{
	// marbles — это массив

	int marbles[SIZE] = { 20, 10, 5, 39, 4, 16, 19, 26, 31, 20 };
	long answer;
	answer = sum(marbles, SIZE);
	printf("The total number of marbles is %ld.\r\n", answer); // Общая сумма элементов массива marbles равна
	printf("The size of marbles is %u bytes.\r\n", sizeof marbles); // Объем памяти, отведенной под массив marbles, составляет байтов
	return 0;
}
// ar — указатель на первый элемент массива marbles
int sum(int ar[], int n) // насколько велик массив?
{
	int i;
	int total = 0;
	for(i = 0; i < n; i++)
		total += ar[i];
	// ar равен всего 4 байтов. Причина в том, что ar — это не сам массив, а указатель на первый элемент marbles.
	printf("The size of ar is %u bytes.\r\n", sizeof ar);
	return total;

}